This is my emacs init org configuration file. Written in org mode style for better maintainability.

*** Load Repos
    Add elpa and marmalade repos.
   #+BEGIN_SRC emacs-lisp
     (require 'package)

     ;; use packages from marmalade
     ;;(add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
     ;;the orgmode elpa
     (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
     ;; and the old elpa repo
     ;;(add-to-list 'package-archives '("elpa-old" . "http://tromey.com/elpa/"))

     ;; and automatically parsed versiontracking repositories.
     ;;(add-to-list 'package-archives '("melpa" . "http://melpa.org"))

(setq package-enable-at-startup nil)
(add-to-list 'package-archives
         '("melpa" . "http://melpa.org/packages/"))
 (add-to-list 'package-archives
         '("gnu" . "http://elpa.gnu.org/packages/"))

    
   #+END_SRC

   #+RESULTS:
   : ((elpa-old . http://tromey.com/elpa/) (marmalade . http://marmalade-repo.org/packages/) (gnu . https://elpa.gnu.org/packages/) (org . http://orgmode.org/elpa/))

** Make xinitrc file
   #+begin_src sh :tangle ~/.xinitrc.emacs
     # Disable access control for the current user.
     xhost +SI:localuser:$USER

     # Make Java applications aware this is a non-reparenting window manager.
     export _JAVA_AWT_WM_NONREPARENTING=1

     # Set default cursor.
     xsetroot -cursor_name left_ptr

     # Set keyboard repeat rate.
     xset r rate 200 60

     # Uncomment the following block to use the exwm-xim module.
     #export XMODIFIERS=@im=exwm-xim
     #export GTK_IM_MODULE=xim
     #export QT_IM_MODULE=xim
     #export CLUTTER_IM_MODULE=xim

     # Finally start Emacs
     exec emacs
   #+end_src

   #+RESULTS:
   : localuser:cb0 being added to access control list

